/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   PmergeMe.hpp                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mweghofe <mweghofe@student.42vienna.com>   +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/05/13 10:01:15 by mweghofe          #+#    #+#             */
/*   Updated: 2026/05/17 15:38:07 by mweghofe         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#pragma once

#include <vector>
#include <deque>

#ifndef DEMONSTRATION
# define DEMONSTRATION 0
#endif

class PmergeMe
{
	private:
	// ---
	std::vector<unsigned int> cVec_;
	std::deque<unsigned int> cDeq_;
	std::vector<std::size_t> jacobsthal_;
	// ---
	void parseInput(int, char**);
	bool isValid(char*);
	int getInputNumber(char*);
	// ---
	void FordJohnsonVec(std::vector<unsigned int>&, std::vector<unsigned int>&);
	void createJacobsthalSequence();
	void buildJacobsthalIndex(const std::size_t&, std::vector<std::size_t>&);
	public:
	// ---
	void execute(int, char**);
	// ---
	PmergeMe();
	PmergeMe(const PmergeMe&);
	~PmergeMe();
	PmergeMe& operator=(const PmergeMe&);
};


/*

•  •  •  •  •  •  •  •  •  •  •  •  •  •  •  •  •  •  •

[• •] [• •] [• •] [• •] [• •] [• •] [• •] [• •] [• •] •

 a b   a b   a b   ...

 a = bigger (winners)
 b = smaller (losers)


   ●  ●  ●  ●  ●  ●  ●  ●  ●
  /  /  /  /  /  /  /  /  / 
 /  /  /  /  /  /  /  /  /  
●  ●  ●  ●  ●  ●  ●  ●  ●  ●


[• •] [• •] [• •] [• •] •

...

================================================================================

   ●––●––●––●––●––●––●––●––●––●––●––●––●––●––●––●––●––●––●
  /  /  /  /  /  /  /  /  /  /  /  /  /  /  /  /  /  /  /
 /  /  /  /  /  /  /  /  /  /  /  /  /  /  /  /  /  /  /
●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●


●  ●––●––●––●––●––●––●––●––●––●––●––●––●––●––●––●––●––●––●
     /  /  /  /  /  /  /  /  /  /  /  /  /  /  /  /  /  /
    /  /  /  /  /  /  /  /  /  /  /  /  /  /  /  /  /  /
   ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●  ●
   ‾  ‾‾‾‾  ‾‾‾‾  ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾  ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
*/
